const Health = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-health w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">وزارة الصحة</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين وزارة الصحة 🚑
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع دخول قطاع وزارة الصحة للتسلية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع طلب الترقية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع ركوب السيارات المدنية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا طلب استقالة قبل مدة اسبوع وبخلاف ذلك يجب عليك
                  دفع غرامة [3] مليون وسجن [30] شهر مع اعطائك رتبة مستقيل.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق لـ رجل الأمن الوطني التدخل في عمل الداخلية والجهات
                  الأمنية الأخرى والعكس كذلك الى بوجود كتاب رسمي من معالي رئيس
                  الوزراء المحترم , ويمكن تبادل الأوامر بين الرتب العليا فقط.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سجل الحضور ضروري جداً عند الدخول والخروج وعلى أساسه تبنى
                  الترقيات والانذارات.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب على المسعف الالتزام بتقمص الشخصية أكثر من أي وظيفة أخرى.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع انتحال شخصية رجل الأمن الوطني أو حمل هويتهم، وفي حال كشف
                  ذلك سوف يتم إعدام منتحل الشخصية بأمر من رئيس الوزراء أو نائبه
                  أو مستشاره.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع منعا باتا حمل أي سلاح الا التيزر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب الإلتزام بزي مسعف أو الدكتور المخصص من وزير الصحة فقط.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عدم تشغيل السفاتي في سيارات الإسعاف الا في الحالات الطارئة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال طلب الشرطي عدم إنعاش الشخص لا يتم الانعاش مع تحمل
                  الشرطي المسؤولية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال وجود اعدام أو انتحار يمنع منعاً باتاً الانعاش إلا بطلب
                  من العسكري مع تحمل العسكري المسؤولية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  مسموح لك ان تحمل 50 بندول و 50 عدة طبية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع بيع العدة الطبية والبندول.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يمكنك عمل أي جريمة أثناء تأدية واجبك كمسعف، كما لا يمكنك
                  تلويت أي شخص.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق للمسعف عدم إنعاش الميت بحالة وحده اذا تكلم الميت بعد
                  تحذيره.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع إنعاش المنتحر والغارق والمحترق.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا الدخول الى السدة واماكن العصابات.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق للمسعف قيادة الطائرة المروحية او الهلكبتر إلا اذا عندة
                  رتية طيار.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لك مخالفة قوانين المرور فقط في حال كان هناك حالة طارئة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  بعد إنعاش الميت يجب تقمص الحالة بالتحمد له على السلامة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب عليك احترام المواطن وعدم التقليل من شأنه.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  التواجد في راديو وزارة الصحة في حال وجودك داخل الخدمة و عدم
                  التواجد سيعرضك لانذار.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع منعاً باتاً استعمال اي سيارة ليست ضمن قطاع الصحة اثناء
                  العمل.
                </li>
              </ol>
            </div>
          </div>
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              السلم الوظيفي 📈
            </div>
            <div className="collapse-content">
              <div className="text-center text-[24px]">مناصب وزارة الصحة :</div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">وزير الصحة</li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  نائب وزير الصحة
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  مدير المستشفى
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  مسؤول مسعفين وزارة الصحة
                </li>
              </ol>
              <div className="text-center text-[24px]">رتب وزارة الصحة :</div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">بروفيسور</li>
                <li className="mb-4 text-[13.999999999999998pt]">استشاري</li>
                <li className="mb-4 text-[13.999999999999998pt]">اخصائي</li>
                <li className="mb-4 text-[13.999999999999998pt]">دكتور</li>
                <li className="mb-4 text-[13.999999999999998pt]">ممرض</li>
                <li className="mb-4 text-[13.999999999999998pt]">مسعف</li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Health;
