const City = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-city w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">المدينة</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين المدينة 📓
            </div>
            <div className="collapse-content">
              <div className="text-center text-[24px]">
                القوانين الاساسية بـ بمدينة 𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 :
              </div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يمكنك تحريك أو خطف ( شخص ميت فقط يمكنك انقاذ حياتة ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع القتل بـ سلاح او المركبة داخل المنطقة الامنة ( يسمح خارج
                  المنطقة الامنة فقط ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع التحدث في الأمور ( العرقية - السياسية - الدينية ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال الاغماء وانت مطارد ( لا يحق لك تذكر الاشياء بعد الإنعاش
                  أو الهروب الا بعد [15] ثانية ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يسمح للادارة اتخاذ اجراء ( في حال كانت هناك مشكلة في المدينة
                  وانتقلت الى الخاص فقط ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع جلب الامور الشخصية الى المدينة ( الامور الشخصية تبقى في
                  الخاص ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع نشر السيرفرات في المدينة ( العقوبة باند نهائي ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع وضع اسم بذيء و اسم غير لائق داخل المدينة ( العقوبة تصل
                  الى الباند ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الاساءة لـ شخص سواء بالقذف أو الشتم الخخ.. ( تصل الى
                  الباند ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب احترام جميع المواطنين ( أياً كانت رتبة ↫ احترامك يدل على
                  تربيتك ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يسمح بـ خطف المواطنين فقط ( في حال ركب في سيارتك ومرت [15]
                  ثانية - وعليك استخدام كلمات انت مخطوف والخ.. ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال خروجك عن الرول بلاي سواء كان سيناريو أو غيرة ( سوف يتم
                  محاسبتك فوراً ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع التكلم أو التحدث ( في حال انك ميت ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يمكنك تحريك أو خطف ( شخص ميت فقط يمكنك انقاذ حياتة ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الصدم العشوائي ( VDM ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع تلويت ( شخص لم تقم بقتلة ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعاً باتاً تلويت ( العساكر - المسعفين - المحاميين ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يسمح بـ تلويت العساكر خارج المنطقة الامنة بـشرط ( عند نزع الزي
                  العسكري ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع تشغيل البرامج التالية : ( تغيير الاصوات - ساوند باند -
                  يوتيوب ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع قتل أو تلويت ( المسعفين ↫ في جميع الاماكن ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق لك دخول الاماكن التالية : ( كراج تعديل - مقرات عصابة )
                  في حال المطاردة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الإسائة للاداري في حال كانت هناك شكوى ( يتم رفعها بروم
                  شكوى على اداري ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال شخص غلط عليك ورديت علية الغلط ( راح يضيع حقك ↫ وسوف يتم
                  محاسبة الجميع ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يسمح سرقة سيارة عساكر في حال وجود ( [2] من السارقين ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يسمح بـ سرقة سيارات الحكومة ماعدا : ( وزارة العدل - وزارة
                  الصحة - والمدرعات - والسيارات المصفحة ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع التجول في سيارة مسروقة فقط يمكنك ( فعل سيناريو أو بيعها )
                  .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع طلب اداري في الاشياء التالية : ( احتاج فلوس - سبب تافة -
                  الخخ.. ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب عليك لبس الماسك ( القناع ) لـ اخفاء شكلك بخلاف ذلك سيتم
                  التعرف عليك لاحقا .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام التالي : ( القلتشات - الهاك - الملفات ↫ العقوبة
                  تصل الى الباند النهائي ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عند موتك والتحلل ( لا يحق لك تذكر أخر [10] دقائق ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عند الاغماء ( موتك ) وتم انعاشك ( لا يحق لك تذكر أخر [5] دقائق
                  ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال إنفجار كفرين ( تايرين ) عليك ( الوقوف فوراً ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الكلبشة في المناطق الامنة ( في حال انك لست في احد
                  القطاعات العسكرية ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع كلبشة ( شخص وهو ميت مهما كان السبب ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق لك ( ادخال المركبات المصفحة داخل المدينة أو الطلق منها
                  ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الخروج عن الرول بلاي الا في حال وجود اداري .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب عليك تقدير حياتك والخوف .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع التحرش منعاً باتاً ومن يخالف ذالك ( سوف تصل العقوبة الـى
                  الباند النهائي ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا طلب استقالة قبل مدة اسبوع وبخلاف ذلك يجب عليك
                  دفع غرامة [3] مليون وسجن [30] شهر مع اعطائك رتبة مستقيل .
                </li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default City;
