const Admin = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-admin w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">الادارة</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين الادارة 🎩
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  احترامك للمواطنين .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع سحب ادمن اخر او مواطن بدون طلب أذن منة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الانتقال لاي ادمن او مواطن الا بحالة طلب الإذن منة
                  وموافقتة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع انعاش اي مواطن بالمنطقه الامنه ( بإٍستثناء ضغط السيرفر او
                  عدم وجود مسعفين ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا الإنعاش في المناطق الغير أمنة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عدم التدخل بأمور الوزارات نهائيا او محاسبتهم ( بل توجية
                  المواطن لرفع شكوى في الديسكورد ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع طلب الترقيات او الاعتراض على ترقيات اشخاص اخرين .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الانتقال للعسكري او المسعف بدون طلب اذن منة قبل الانتقال
                  ( الا في حالة وجود مقطع يثبت الشكوى ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع اعطاء رتبة لاي احد بدون التأكد بإمتلاكة الرتبة في
                  الديسكورد .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع سجن المواطنين بدون ذكر السبب كامل ومن يخالف سوف يتم
                  احتساب تحذير اول قوانين إدارة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع ذكر اسم ادمن او كلمة ( هاك ) بالشات العام ويمكنك ان
                  تذكرهم بشات الأدمنية .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عقوبة الادمن اكثر من عقوبة المواطن نفسة لانك واجهة السيرفر .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع محاسبة ادمن اخر او التدخل في شؤونة ( يعرضك لتحذير اول
                  قوانين إدارة ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  مدة التحذير 7 أيام ويتم ازالة التحذير في حالة تواجدة وقبولة
                  الدائم للطلبات .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع اللعب داخل الرول بلاي اثناء تسجيل دخولك كأدمن .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  اذا كنت تلعب ك مواطن وشفت مشكلة قدامك ممنوع تسجل دخول وتتدخل
                  فيها او شي ( تطلب ادمن وهو يحلها فقط ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع التكلم بأمور التهديد عند المواطن نهائيا مثل ( الباند -
                  السجن ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام خواص الادمنية امام المواطنين مثل الطيران او
                  التنقل .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع على الأداري اقامة اي فعالية بدون طلب من مسؤولين الفعاليات
                  .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  اجتماع الادارة الاسبوعي يوم الخميس الساعه 12 بتوقيت العراق (
                  يجب عليك ذكر العذر في حال عدم مقدرتك على التواجد ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جميع المخالفات لا تتعدا ال 15 شهر سجن .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع التدخل بأي مشكلة أداري أخر .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب ان يكون اسمك داخل الديسكورد مطابق لأسمك داخل المدينة (بدون
                  زخرفة) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال تم تبنيد اي شخص يمنع التدخل في المشكلة وانما ارسالة الى
                  طلب فك الباند .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع اي ادمن يشيل رتبة احد من الدسكورد الا بأذن المسؤول فقط .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  اي صانع محتوى يخرب في السيرفر لك الحق كصفتك اداري تحاسبة بنفس
                  عقوبة المواطن بعد انتهاء المحتوى .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع اي اداري يتدخل بأمور الهيتمان نهائيا يوجد مسؤولين .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  اي اداري طلباتة اقل من [350] خلال اسبوع واحد سيتم انزال تحذير
                  علية .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال بدء المواطن في السب والقذف يتم محاسبتة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  المساعدة في امور القطاعات الحكومية او العصابات من تنظيم
                  سيناريو و غيره .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال كنت اداري يجب عليك التفاعل بمهمتك بشكل دائم .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال وجود طلب ادمن في المنطقة الغير امنة يمنع حل المشكلة
                  داخل المكان .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  اي إداري يعرف ثغرة او قلتش ومايتواصل مع الادارة سيتم محاسبتة
                  وفي حال استخدامة سيتم فصلة من الإدارة مباشرة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا التكلم بالسوء عن السيرفرات الاخرى او التطرق لـ
                  اشخاص خارج السيرفر منعا باتا .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال كان المواطن محترم و متقبل للعقوبة يحق للادمن تخفيف
                  السجن علية الى نص المده .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع سحب الإداريين في الرومات الصوتية بدون أذن او استخدام
                  صلاحياتك بالديسكورد بشكل خاطئ .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عند تقديم استقالة واردت الرجوع الى الادارة لن يتم ارجاعك بنفس
                  الرتبة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال اللعب ك ادمن داخل السيرفر يجب تواجدك داخل رومات
                  الديسكورد .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع طلب اجازه اكثر من 3 ايام بدون سبب مقنع .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع انعاش اي رجل عصابة داخل مقره في وقت السيناريو حتى لو
                  انتهى السيناريو .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا توصيل المواطنين الا بحالة عدم وجود سائق اوبر .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال دخولك لسيرفر اللوقات يجب تغيير اسمك هناك ليتطابق مع
                  اسمك هنا .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب استخدام شات الادارة داخل السيرفر في حال طلب مساعدة من
                  الاداريين الاخرين .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منع باتا انتقال الاداري الى الادارة العليا من غير طلب
                  انتقال او اذن ب شات الادارة داخل اللعبة والا سيتم احتساب تحذير
                  اول و ثاني اداري انتقال عشوائي , يفضل التواصل معهم داخل
                  الدسكورد لامور خارج الرول بلاي .
                </li>
              </ol>
            </div>
          </div>
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              سلم الرتب 📈
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">Owner</li>
                <li className="mb-4 text-[13.999999999999998pt]">Co Owner</li>
                <li className="mb-4 text-[13.999999999999998pt]">Commander</li>
                <li className="mb-4 text-[13.999999999999998pt]">Ceo</li>
                <li className="mb-4 text-[13.999999999999998pt]">Executive</li>
                <li className="mb-4 text-[13.999999999999998pt]">Head Admin</li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  Super Admin
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">Admin</li>
                <li className="mb-4 text-[13.999999999999998pt]">Moderator</li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  Super Visor
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">Trusted</li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Admin;
