const Cia = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-cia w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">الامن الوطني</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين الامن الوطني 💥
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لـ رجال الأمن الوطني أن يفتشوا منزلك أو سيارتك إذا تم
                  الاشتباه بك، ومصادرة أي ممنوعات.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع تعتقل شخص وأنت لابس البس المدني منعاً باتاً.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع تركب السيارات المدنية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمكن لرجال الأمن الوطني مساندة القوات الأمنية الأخرى في حال
                  طلب ذلك وفقط في سرقة البنك المركزي أو محطة القطار أو الميناء
                  أو المجوهرات أو المداهمات على المقرات الحكومية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق لـ رجل الأمن الوطني التدخل في عمل الداخلية والجهات
                  الأمنية الأخرى والعكس كذلك إلا بوجود كتاب رسمي من معالي رئيس
                  الوزراء المحترم، ويمكن تبادل الأوامر بين الرتب العليا فقط.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق كلبشة رتبة أعلى منك سواء في الأمن الوطني أو الجهات
                  الأمنية الأخرى إلا بأمر من رئاسة الوزراء أو في حال أثبتت خيانة
                  الشخص المعني.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع مناداة رجل الأمن الوطني بأسمائهم وكشف هويتهم الوظيفية،
                  وفي حال مخالفة ذلك يحق لهم سجنك [15] شهر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع انتحال شخصية رجل الأمن الوطني أو حمل هويتهم، وفي حال كشف
                  ذلك سيتم إعدام منتحلي الشخصية بأمر من رئيس الوزراء أو نائبه أو
                  مستشاره.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لعناصر الأمن الوطني إطلاق النار على المركبة والكفرات دون
                  انتظار [40] ثانية في حال كان المجرم حاول الهرب بعد أن تم
                  توقيفه للمرة الثانية على التوالي.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع سرقة سيارة الأمن الوطني أو سيتم سجنك لمدة 20 شهرًا أو قد
                  تصل العقوبة إلى الإعدام.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال الاشتباه بشخص وإيقافه وأثبتت برائته يتم تعويض المواطن
                  بمبلغ مالي قدره (1,000,000).
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب على المواطنين مسايرة رجال الأمن الوطني بالرول بلي وعدم طلب
                  الإدارة عن أتفة الأسباب، وفي حال كنت تريد طلب الإدارة، فاطلبه
                  بعد انتهاء السيناريو.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  إذا قدمت استقالة ولم تكمل أسبوعين بالقطاع سيتم فصلك وتغريمك
                  بمبلغ مقداره (10,000,000) وسجنك 30 شهرًا.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعاً باتاً الركوب مع أي مواطن إلا في حالة خروجك كـعميل
                  سري وفي حالة الخطف عدم الإفصاح عن هويتك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع على رجل الأمن الوطني مخالفة قوانين المرور كقطع الإشارات
                  ويحق لشرطي المرور محاسبته، إلا إذا كان في مهمة سرية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عناصر الأمن الوطني ممنوع ياخذون عسكري للتحقيق أو للمحاسبة الا
                  بعد اخذ اذن من وزير الداخلية او نائبه او قائد المكافحة او
                  نائبه واذا كان الفاسد هو احد الشخصيات المذكوره اعلاه يرفع كتاب
                  الى رئيس الوزراء لمحاسبتهم.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  اقصى حد لتحقيق [30] دقيقة ولو تم كلبجتك من قبل العميل لايحق لك
                  الكلام في الراديو تعتبر مخالف رول بلي.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا الكشف عن هويتك، وبخلاف ذلك سيتم اعدامك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا طلب استقالة قبل مدة اسبوع وبخلاف ذلك يجب عليك
                  دفع غرامة [3] مليون وسجن [30] شهر مع اعطائك رتبة مستقيل.
                </li>
              </ol>
            </div>
          </div>
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              السلم الوظيفي 📈
            </div>
            <div className="collapse-content">
              <div className="text-center text-[24px]">المناصب العسكرية :</div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  مدير جهاز الامن الوطني
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  معاون مدير جهاز الامن الوطني
                </li>
              </ol>
              <div className="text-center text-[24px]">الرتب العسكرية :</div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  ضابط جهاز الامن الوطني
                </li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Cia;
