const Discord = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-discord w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">الدسكورد</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين الدسكورد 📑
            </div>
            <div className="collapse-content">
              <div className="text-center text-[24px]">
                القوانين الاساسية بـ الدسكورد 𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 :
              </div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  عدم أثارة المشاكل بالسيرفر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  احترم خصوصية الآخرين وعدم احراجهم.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  مراعاة نظام كل روم وسياسته وقوانينه.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع السبام أو إرسال بكثرة بوقت قصير.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع طلب المال - بطاقات الستور - الألعاب.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع دخول السيرفر بالأسماء والصور الغير لائقة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع نشر الروابط مثل السيرفرات، المقاطع، التويتش حتى على
                  الخاص.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  احترم جميع الموجودين في السيرفر احترم المشرفين والمسؤولين.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حالة وجود مشكلة يرجى التوجه للدعم الفني أو فتح تذكرة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حالة نشر أي سيرفر آخر في الخاص يرجى تبليغ الإدارة أو
                  المشرفين بسكرين (صورة شاشة).
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام برامج تغيير الصوت إلا في حالة موافقة من المشرفين
                  أو الإدارة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع التحدث عن السياسة، الدين، القبائل، الهاك، الحسابات
                  المخترقة وتلميح عن أمور غير أخلاقية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال وجود خلاف أو انتهاك للقوانين من قبل أحد المشرفين يرجى
                  إبلاغ الإدارة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع إرسال صور عادية أو متحركة في الشات العام أبداً.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع مضايقة البنات والشباب.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع طلب الرتب مهما كان قرابتك من الإدارة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع الازعاج صناع المحتوى على الخاص أو العام.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع التقليل من قيمة الشخص في الشات حتى ولو كان صديقاً أو
                  صديقة لك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع البسامير أو كلمات تقصد بها أحد الأعضاء، ذلك سوف يؤدي
                  لتحذيرك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال حدوث مشكلة يمنع التدخل بها إذا كان المشرف أو المسؤول
                  موجوداً لحل المشكلة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جميع القوانين في الديسكورد قابلة للتعديل لذلك وجب التذكير.
                </li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Discord;
