const Scenarios = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-scenarios w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">السناريوهات</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين السناريوهات 🎥
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب عليك كرهينة الحفاظ على حياتك و تقدير موقفك و تنفيذ جميع
                  اوامر الخاطف كذلك توضح للخاطف انك خايف ع حياتك .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعاً باتاً مشاركة الرهينة مع الخاطفين في نص السيناريو او
                  بعد مدة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا طلب خدمات المواطنين مثل ( شرطي , اوبر , مسعف ,
                  الخ.. ) وخطفهم أو قتلهم .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب عليك ان تكون مسلح و لا تعتبر الرهينة مخطوفه الا في حال تم
                  تقيدها و بامكانة الهروب في حال عدم انتباه الخاطفين .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب عليك الجدية الكاملة في التفاوض و اخذ الموضوع بشكل جدي و
                  الخوف على حياتك وتقدير موقفك .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لك قتل الرهينة اذا الرهينة لم يخاف على حياتة او اذا لم يتم
                  الاتفاق مع الشرطة في المفاوضة و فشل التفاوض .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع قتل الرهينة اذا كانت تنفذ اوامر الخاطف .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا المفاوضة على رهينة ليست موجودة بموقع السيناريو
                  .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا استخدام القلتشات في السيناريو .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة البقالة .
                </li>
                <ul className="mb-4">
                  <li>عدد الذين يستولون على البقالة [2] الى [4] </li>
                  <li>والعساكر يجب ان لا يقل عددهم عن [3] إلى [5]</li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو البنك المركزي .
                </li>
                <ul className="mb-4">
                  <li>عدد الذين يستولون على البنك المركزي عدد مفتوح</li>
                  <li>والعساكر عدد مفتوح</li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة المجوهرات .
                </li>
                <ul className="mb-4">
                  <li>عدد الذي يستولون على المجوهرات [4] الى [8] اشخاص</li>
                  <li>
                    والعساكر يجب ان لا يقل عددهم عن [4] ولا يزيد عن [10] اشخاص
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة اليخت .
                </li>
                <ul className="mb-4">
                  <li>عدد الذي يستولون على اليخت [4] الى [9] اشخاص</li>
                  <li>والعساكر يجب ان لا يقل عددهم عن [4] ولا يزيد عن [11]</li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة البيوت .
                </li>
                <ul className="mb-4">
                  <li>عدد الذي يستولون على البيوت [3] الى [5] اشخاص</li>
                  <li>
                    والعساكر يجب ان لا يقل عددهم عن [3] ولا يزيد عن [7] اشخاص
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة محطة القطار .
                </li>
                <ul className="mb-4">
                  <li>عدد الذي يستولون على المحطة عدد مفتوح</li>
                  <li>والعساكر عدد مفتوح</li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة مدينة العاب .
                </li>
                <ul className="mb-4">
                  <li>
                    عدد الذي يستولون على مدينة الالعاب من [4] الى [9] اشخاص
                  </li>
                  <li>
                    والعساكر يجب ان لا يقل عددهم عن [4] ولا يزيد عن [11] اشخاص
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة الموانئ .
                </li>
                <ul className="mb-4">
                  <li>عدد الذي يستولون على الموانئ من [5] الى [11] اشخاص</li>
                  <li>
                    والعساكر يجب ان لا يقل عددهم عن [5] ولا يزيد عن [13] اشخاص
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة مصرف .
                </li>
                <ul className="mb-4">
                  <li>عدد الذي يستولون على المصرف من [3] الى [6] اشخاص</li>
                  <li>
                    والعساكر يجب ان لا يقل عددهم عن [3] ولا يزيد عن [7] اشخاص
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة محل أسلحة .
                </li>
                <ul className="mb-4">
                  <li>عدد الذي يستولون على محل أسلحة من [3] الى [8] اشخاص</li>
                  <li>
                    والعساكر يجب ان لا يقل عددهم عن [3] ولا يزيد عن [10] اشخاص
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو سرقة معمل خياطة .
                </li>
                <ul className="mb-4">
                  <li>
                    عدد الذي يستولون على معمل الخياطة من [3] الى [7] اشخاص
                  </li>
                  <li>
                    والعساكر يجب ان لا يقل عددهم عن [3] ولا يزيد عن [9] اشخاص
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سيناريو الخطف العساكر والمواطنين .
                </li>
                <ul className="mb-4">
                  <li>
                    ممنوع خطف من هم في الوزرات المدنية بلا استثناء ويقصد هنا (
                    الاعلام والترفية و العدل و الصحة )
                  </li>
                  <li>
                    ممنوع حال دخول مواطن للموقع المسروق يحق لك اخذه كرهينة
                  </li>
                  <li>
                    لا يحق لك قتل المخطوف في حال تم تنفيذ مطالبك واذا لم ينفذ لك
                    الحق بقتلة دون طلب مسعف
                  </li>
                  <li>
                    المناطق الامنة يسمح بها الخطف كما يمنع القتل وتلويت المواطن
                  </li>
                  <li>
                    مدة سناريو الخطف للعسكري [15] دقيقة في حال تم اخذه كرهينة لك
                    الحق لغاية [15] دقيقة تركة او قتلة
                  </li>
                  <li>لا يحق لك خطف العسكري اذا لم يكن هناك [4] من العساكر</li>
                  <li>
                    مده سناريو خطف المواطن لا يزيد عن [10] دقائق واذا كان هناك
                    سيناريو خطف مواطن لك الحق الاحتفاض بة [10] دقيقه وبعد ذالك
                    قم بقتله او تركة
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سناريو سرقة السيارات العسكرية .
                </li>
                <ul className="mb-4">
                  <li>يمنع سرقة السيارات المدرعة أو المصفحة بشكل عام</li>
                  <li>يجب أن يكون عدد السارقين اثنين [2] فما فوق</li>
                  <li>يجب أن يكون عدد أفراد الشرطة [4] أفراد و أكثر</li>
                  <li>يجب أن يكون المبلغ المطلوب لا يزيد عن [50] الف</li>
                  <li>
                    يمنع سرقة سيارة الشرطة من أجل التجوال في المدينة ( السرقة
                    فقط من اجل طلب مبلغ مالي أو سيناريو )
                  </li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  سناريو التفاوض على الرهائن .
                </li>
                <ul className="mb-4">
                  <li>
                    يحق للمفاوض طلب على الرهينة ( المواطن ) مبلغ مالي وقدره [60]
                    الف فقط
                  </li>
                  <li>
                    يحق للمفاوض طلب على الرهينة ( العسكري ) مبلغ مالي وقدره [70]
                    الف فقط
                  </li>
                  <li>
                    يحق للمفاوض طلب على ( السيارة العسكرية ) مبلغ مالي وقدره
                    [50] الف فقط
                  </li>
                  <li>
                    في حال التفاوض لا يسمح لك التعامل بطريقة همجية داخل السناريو
                  </li>
                  <li>
                    في حال حضور العساكر للموفع ( مربع الموقع 100*100 ) يصبح
                    الموقع امن ولا يسمح به الخطف والقتل
                  </li>
                  <li>
                    في حال تم قتل احد الرهائن يحق للمتفاوض افشال التفاوض واطلاق
                    النار فورا
                  </li>
                  <li>
                    وفي حال تعاملة بطريقة همجية او تمت اهانة المتفاوض يفشل عليك
                    التفاوض
                  </li>
                  <li>
                    يمنع الخروج والوقوف خارج باب الموقع المسروق فقط من يحق لة
                    الخروج هو ( المتفاوض ) فقط
                  </li>
                </ul>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Scenarios;
