const Verifed = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-verifed w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">صناع المحتوى والستريمر</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين صناع المحتوى والستريمر 📺
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  القوانين فوق الجميع سواء كان مواطن أو صانع محتوى او ستريمر
                  يحاسب كما يحاسب الآخرين .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحاسب صانع المحتوى أو الستريمر إلى بعد أنتهاء بثة أو تصويرة
                  .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  صانع المحتوى أو الستريمر ليس لدية حق في أخذ سيارة عسكرية
                  للتصوير ألا بعد أخذ آذن من أعلى رتبة موجودة في القطاع العسكري
                  المراد .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع تخريب تصوير أو بث صانع المحتوى متعمداً وبخلاف ذلك سيتم
                  سجنك 15 شهر .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع تخريب تصوير أو بث صانع المحتوى متعمداً وبخلاف ذلك سيتم
                  سجنك 15 شهر .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع على صانع المحتوى أو الستريمر قتل المواطنين أو مخالفة
                  قوانين السيرفر .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال دخل الستريمر سيناريو وتم قتلة وأنعاشة وتم القاء القبض
                  علية يتم أعطائة سجن 3 أشهر فقط وفي حال تم أهانة العساكر من قبل
                  الستريمر أو صانع المحتوى يحق للعسكري سجنة 15 شهر .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع على صانع المحتوى أو الستريمر لبس زي عسكري بدون رتبة
                  عسكرية .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  أحترم تحترم أحترامك يعكس أخلاقك وتربيتك .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  شروط اخذ الرتبة - 2500K - كتابة رابط الدسكورد او هاشتاك
                  السيرفر في المقاطع والبثوث !
                </li>
              </ol>
              <div className="text-center text-[24px]">
                - يجب وضع رابط الديسكورد واسم السيرفر وهاشتاك السيرفر في كل بث
                او مقطع في السيرفر -
              </div>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Verifed;
