const Mod = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-mod w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">وزارة الدفاع</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين وزارة الدفاع 💂
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  احترام المواطنين وحسن المعاملة وخلاف ذلك يتم محاسبة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عدم التكلم باسم أي جهة حكومية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع ركوب سيارة مدنية وأنت لابس الزي العسكري.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع ركوب سيارة عسكرية وأنت لابس الزي المدني.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع إخراج آليات ثقيلة إلى بأمر القائد وبخلاف ذلك تعرض نفسك
                  للمخالفة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  نظام الترقيات يكون كل 7 أيام للجنود وكل 14 يوم للضباط وكل شهر
                  لأصحاب المناصب.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جميع الصلاحيات الممنوحة لمنسوبي وزارة الدفاع مقيدة داخل
                  المدينة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع التوجه إلى السرقات داخل المدينة إلا في حال قامت وزارة
                  الداخلية بطلب دعم ويجب على منسوبي وزارة الدفاع تنزيل إعلان
                  مساندة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جميع تحركات وزارة الدفاع يجب أن تكون باعلان.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  تمشيط المناطق الغير آمنة يجب أن يكون باعلان رسمي.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الشخصنة أو الحقد على أفراد الوزارات الأخرى وأفراد
                  العصابات.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا طلب استقالة قبل مدة أسبوع وبخلاف ذلك يجب عليك
                  دفع غرامة 3 مليون وسجن 30 شهرا مع اعطائك رتبة مستقيل.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا الخروج عن الرول بلاي إلا في حال وجود أداري.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع للعناصر التجول بالهوية العسكرية بالملابس المدنية والعكس
                  أيضاً.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع اهانة أحد منسوبي وزارة الدفاع وبخلاف ذلك سيتم سجنك 20
                  شهرا مع غرامة 500 ألف.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  على جميع منسوبي وزارة الدفاع الاكتفاء بطلب الهوية فقط لمنسوبي
                  الوزارات الاخرى.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق لك رمي على مواطن إلا بعد ضرب السيطرة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق لك الرمي على شخص إلا بعد تحذيره ثلاث مرات.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يحق لمنسوبي وزارة الدفاع الدخول الى المدينة إلا في حال تم
                  طلب دعم من وزارة الداخلية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  وزارة الدفاع تابعة إلى رئاسة الوزراء حصراً.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  وزارة الدفاع صلاحيتها خارج الآمنة فقط وليس وصلاحيتها مقيدة
                  داخل المناطق الآمنة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع على منسوبي وزارة الدفاع عدم احترام القوانين المرورية وعدم
                  تطبيقها.
                </li>
              </ol>
            </div>
          </div>
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              السلم الوظيفي 📈
            </div>
            <div className="collapse-content">
              <div className="text-center text-[24px]">المناصب العسكرية :</div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  وزير الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  نائب وزير الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  مستشار وزير الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  مسؤول وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  نائب مسؤول وزارة الدفاع
                </li>
              </ol>
              <div className="text-center text-[24px]">الرتب العسكرية :</div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  فريق اول وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  فريق وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لواء وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عميد وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عقيد وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  مقدم وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  رائد وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  نقيب وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ملازم اول وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ملازم وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  رئيس عرفاء وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عريف وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  نائب عريف وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جندي اول وزارة الدفاع
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جندي وزارة الدفاع
                </li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Mod;
