const Gangs = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-gangs w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">العصابات</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين العصابات 💀
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  القتل خارج المناطق الآمنة دون تهديد وإنما قتل فوري.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حالة وجود مخالفة في سيناريو يمنع طلب إداري في منتصف
                  السيناريو ويسمح لك بعد أنتهاء السيناريو طلب إداري.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الترصد لمقر العصابات منعا باتا ومن يخالف سيتم محاسبته.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب على جميع أعضاء العصابة تقمص شخصية رجل العصابة والأعمال
                  الإجرامية بكل احترافية.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع تجريح و إهانة مواطن او أحد من رجال الدولة بأي طريقة وفي
                  حال المخالفة سيتم تحذير العصابة وقد تصل الى الباند المؤقت
                  للمتسبب.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يسمح فقط للمتفاوض التقدم خارج الموقع المسروق.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع على المواطنين المشاركة في سيناريوهات مع العصابة الا بعد
                  نشر اعلان.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع صعود الجبال و استخدام السنايبر في أي سيناريو مهما كان إلا
                  في حال متفق عليه بين الطرفين من قبل.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يسمح الاستيلاء على الأغراض - التلويت - خارج الآمنة فقط مره
                  واحدة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع رفض أي سيناريو تم إعلانه ضد عصابة بغرض التهرب من
                  السيناريو أو إعلان سيناريو أخر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  رئيس العصابة هو المسؤول عن تصرفات أفراد عصابته وأي مخالفة تعرض
                  العصابة كاملة للتحذير أو محاسبة الفرد المسبب للمخالفة هذا الشي
                  راجع لمسؤولين العصابات فقط.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال دخول شخص غريب داخل مقر العصابة يسمح خطفه او قتله
                  وتلويته بدون سابق انذار.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب على جميع الأعضاء مراجعة قوانين العصابات بأستمرار وتشغيل
                  برنامج التصوير لتجنب المشاكل.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال كانت العصابة تود مداهمة مقر يجب عليها كتابة إعلان
                  مداهمة وأنتظار الرد من الطرف الآخر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب على العصابة الألتزام بملابس موحده يتم تحديده من قبل رئيس
                  العصابة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع منعا باتا إبقاء المخطوف اكثر من 15 دقيقة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام جميع الطائرات والمدرعات بكافه أنواعها خارج الأمنة
                  بدون اعلان.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعاً باتاً كلبشة شخص وهو ميت.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام المدرعة - مصفحة داخل المناطق الامنة ومن يخالف
                  ستتم محاسبتة من قبل الادارة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتاً كتابة اي شي بالشات في حال وجود سيناريو او بعد
                  سيناريو مثل تخريم انعاش في حال لديك مشكلة قدم شكوى
                  بالرومات المخصصة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام صلاحيات العصابات مثل : الكلبشة , السحب , اخذ
                  رهينة داخل المناطق الامنة الا في المناطق المشبوهه بعد تهديد
                  مسبق.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لا يسمح لـ أفراد العصابة انعاش عسكري او مواطن بغرض خطفه.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال كنت في مطاردة مع القوات الامنية يمنع دخول أي مقر عصابة
                  لغرض الأختباء أو الهروب ويسمح لك بدخوله بعد دقيقة من المطاردة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حالة وجود سرقة او سيناريو في مناطق السرقة مسموح القتل و
                  الخطف و يمنع الخطف بعد قدوم العساكر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال أردت خطف مواطن في المناطق الغير امنة بجب ان يكون عددكم
                  2 او اكثر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام السكنات او الشخصيات الغير لائقة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق للعصابات طلب دعم من اكثر من عصابة في سيطرة حارة العصابات.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع انزال اي اعلان كاذب لسبب ما منعا باتا.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع المتاجرة بالأسلحة للعامة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا طلب استقالة قبل مدة اسبوع وبخلاف ذلك يجب عليك
                  دفع غرامة [3] مليون وسجن [30] شهر مع اعطائك رتبة مستقيل.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع على العصابة خطف ميكانيكي أو اوبر عند طلبهم منعا باتا.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعا باتا اهانة اي مواطن أو جهة رسمـية في الإعلانات
                  الرسمـية بأي شكل كـان.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق للعسكري اعتقالك في حال تم رؤيتك وانت مرتدي قناع/ماسك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جميع قوانين المدينة تنطبق على العصابات دون استثناء.
                </li>
              </ol>
            </div>
          </div>
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              عصابات المدينة 🚬
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  Black Market
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  The Lost MC
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  Grove Street
                </li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Gangs;
