const Market = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-market w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">البلاك ماركت</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين البلاك ماركت 🛒
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  التعامل الاخوي بين الاعضاء اي مشكله او تجاوزات بين الاعضاء
                  تؤدي الى عقوبتهم والتكرار يودي الى الفصل{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  يمنع منعاً باتاً السب أو الشتم بجميع أنواعه الاحترام شي اساسي
                  في البلاك ماركت{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  ممنوع دخول جميع معدات البلاك ماركت بدون استثناء الى المناطق
                  الامنة{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  تستخدم المعدات التي تحتوي على كنر فقط والطائرات في اوقات
                  التمشيط والسيناريوهات{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  لايسمح بأستخدام ألاليات الثقيلة كالدبابات او الطيارات المسلحة
                  و ال rbg و الكنرات المتفجرة و ال c4 و القناصات الا في حاله
                  الاتفاق بين طرفين{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  المخالفات والشكاوي الكثيرة على اي شخص من الاعضاء تؤدي الى فصله{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  عدم الرمي من خلال مصفحه الكورما *المصفحه تستخدم للتنقل في
                  المناطق الغير امنه فقط ولايسمح دخولها للأمنه{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  ممنوع خروج اي طائرة من مقر البلاك ماركت الا باذن الرئيس او
                  النائب{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  يمنع منعا باتا الرمي وانت داخل المقر على اي سيارة او مواطن
                  قريب من المقر{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  اي شخص يعتدي عليك وانت داخل المقر تطلب عليه ادمن وهو راح
                  يحاسبه لا تقتله ويضيع حقك{" "}
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  {" "}
                  اهم شي البلاك ماركت دولة متكامله وليست عصابه وتعتبر جزء مهم من
                  السيرفر{" "}
                </li>
              </ol>
              <div className="text-center text-[24px]">
                قوانين مهمه يجب اتباعها
              </div>
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  الالتزام بالرول بلي مطلوب لأنكم تمثلون البلاك ماركت
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  الالتزام بقوانين السيناريوهات
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب أن تلتزم بالحياة الواقعية حتى في المشاكل حتى يأتي أحد
                  المشرفين لحل المشكلة
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الاعتداء على المسعف بأي طريقة سواء قتله أو تكسير سيارته
                  وغيرها
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع القتل بجميع أنواعه في المناطق الآمنة
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع قتل أو خطف الميكانيكي وأوبر عند طلبهم
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  كثير من المواطنين راح يحاولون يسوون سيناريو معك فكن ودودًا
                  معهم وسايرهم بالسيناريو
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع منعًا باتًا تلويت المسعفين أو الشرطة يسمح تلويت الشرطي
                  إذا كان بالمهجورة
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع التلويت في المناطق الآمنة مثال: شفت واحد ميت جنب الحديقة
                  ممنوع تلوته
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع سرقة سيارات الإسعاف
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  الحديث بشات اللعبة يخضع للرول بلاي وسوف يتم محاسبة من يتكلم
                  بالشات خارج الرول بلاي
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عدم ذكر اسم أي سيرفر
                </li>
              </ol>
            </div>
          </div>
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              القوانين الخاصه بالبيع 🚬
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  التعامل مع الزبون باحترام تام
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  أسعار الأسلحة متوفرة في متجر الأسلحة في الديسكورد
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  التخفيض على الأسلحة يكون 20% كحد أقصى
                </li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Market;
