const Heros = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-heros w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">الابطال الخارقين</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين الابطال الخارقين 🦾
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع القتل في المناطق الامنة بدون مهمة مطلوبة منك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع قتل قاتل مأجور بقاتل مأجور اخر أو جوكر بـ جوكر آخر أو
                  باتمان آخر بـ باتمان.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع توزيع اسلحة القاتل المأجور على المواطنين والعقوبة سحب
                  رتبة القاتل المأجور.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جميع ما يفعلة القاتل الماجور يعتبر سيناريو.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  بعد قبول طلب الاغتيال ب ( 30 ) ثانية راح تطلع جمجمة بالخريطة (
                  مكان الضحية ) وراح تكون حولة دائرة باللون الاحمر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  اذا كان الضحية في سيناريو او مداهمة يمنع قتلة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع الكشف عن هويتك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  بين كل اغتيال و اغتيال ( 30 ) دقيقة فقط.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  عند طلب القاتل يسمح ب الاتفاق معه على قتل شخص ولكل عملية لها
                  قيمة مختلفة يحددها القاتل على حسب خطورة العملية والشخصية
                  المطلوبة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يسمح للقاتل استخدام اللباس العسكرية في حال كان الهدف عسكري
                  للتوغل بينهم والتمكن من التقرب للهدف ولاكن لايسمح ب ارتداء
                  رتبة عالية فقط شرطي او جندي.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  الحد الادني لطلب قاتل مأجور ( 250 الف ).
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع سرقة سيارة القاتل الماجور ومن يخالف ذالك يعرض نفسة للسجن
                  ( 30 ) شهر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يجب على القاتل تنزيل الاعلان قبل اي عملية ( مثال ) يكتب
                  بالاعلان : سيتم اغتيال صاحب الهوية ( 1 ) في اللحضات القادمة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع تلويت اي شخص في حال كنت مسجل في بطل خارق.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  جميع قوانين السيرفر تنطبق على جميع الابطال.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لباتمان المشاركة في السيناريوهات او المداهمة مع الحكومة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام سيارة باتمان الا في حال وجود مطاردة مع شخص هارب
                  او مطلوب من الحكومة أو في التمشيط.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام الاسلحة في السيارة الا خارج المنطقة الامنة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال كان لديك مهمة , يجب أبقاء الهارب على قيد الحياة حتى
                  تسليمة ويمكنك قتلة فقط في حال سائت الامور.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  أقصى مدة للتمشيط هي ( 20 ) دقيقة وبين كل تمشيط ( 30 ) دقائق
                  وفي حال تم قتلك في التمشيط يمنع الرجوع مرا أخرى.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  وجود باتمان في المدينة داعية للخير.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع رفع اسلحتك الخاصة داخل المدينة امام المواطنين دون سبب
                  مقنع.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال كان هناك هيتمان يود ان يغتالك , يحق لك استخدام جميع
                  اسلحتك وتتبعة , في حال استسلامة يجب تسليمة لمركز الشرطة , غير
                  هذا يجب قتلة نهائيا.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لباتمان طلب المساندة من القوات الامنية في حال تمت مداهمتة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال وجود اكثر من باتمان في المدينة , يحق لهم التحالف فقط
                  وقت المداهمات الصعبة او الاشخاص الصعب القبض عليهم.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حال مخالفتك لـ احدى هذه الـقوانين , قد تعرضك الى سحب رتبة
                  منك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع تسجيل دخول اي بطل خارق داخل المدينة لغرض استخدام صلاحياتة
                  اثناء اللعب بزي مدني.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام الخواص داخل مصنع الدجاج.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع اعطاء اي شخص اسلحة باتمان.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام سيارات باتمان خارج المناطق الامنة الا في حالة
                  سيناريو مع الحكومة وفي حال التمشيط خارج الامنة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لباتمان المشاركة في اي سيناريو مع العساكر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لباتمان التعرف على رجل العصابة من الهوية و يمنع رفض الهوية
                  في حال مسكك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يتم فتح جميع الترددات العسكرية لرتبة بات مان و يحق له المشاركة
                  الأعمال الميدناية معا العساكر كـ ( محقق ) ويحق له المطاردة
                  واعتقال الاشخاص المخالفين وتسليمهم للعساكر والتحقيق في امرهم.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع سرقة سيارة باتمان ومن يخالف ذلك بعرض نفسة لـ سجن ( 20 )
                  شهر.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع اغتيال شخص الى في حال شخص طلب منك ذلك.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع استخدام لبس غير لبس الحزمة ( لبس مدني ) وبخلاف ذلك سحب
                  حزمة لمدة [24] ساعة.
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع مساندة بطل خارق في الاغتيال.
                </li>
              </ol>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Heros;
