const Prime = () => {
  return (
    <>
      <section className="rules bg-background-500 h-screen">
        <div className="banner flex flex-col justify-center items-center bg-prime w-full h-[25rem] bg-cover bg-center opacity-70">
          <h2 className="text-[40.0pt]">𝖨𝖱𝖠𝖰 𝖫𝖤𝖦𝖤𝖭𝖣𝖲 𝖱𝖯</h2>
          <h2 className="text-[40.0pt]">رئاسة الوزراء</h2>
        </div>
        <div className="flex flex-col gap-4 m-5">
          <div tabIndex={0} className="collapse collapse-arrow bg-[#141415]">
            <div className="collapse-title text-[24.0pt] text-white font-black flex items-center justify-center">
              قوانين رئاسة الوزراء 👑
            </div>
            <div className="collapse-content">
              <ol className="p-8">
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق للرئاسة الوزراء زيارة أي قطاع عسكري أو مدني في الحالات
                  التالية :
                </li>
                <ul className="mb-4">
                  <li>
                    يجب صدور إعلان رسمي بوجود رتب عليا لإستقبال الرئاسة في
                    المكتب المخصص له
                  </li>
                  <li>اخذ موافقة من رئاسة الوزراء .</li>
                </ul>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع سجن أو محاسبة الرئاسة ، من أي قطاع كان .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق للرئاسة المشاركة في أي سيناريو عسكري أو مدني .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لرئيس الوزراء ( فصل أو نقل أو معاقبة أو ترقية ) عسكري أو
                  مدني من أي قطاع .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  لايحق للرئاسة طلب دعم من العصابات في حمايته نهائياً .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع اغتيال الرئاسة لأي سبب كان .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  رئيس الوزراء ومن ينوب عنة يكون مسؤول عن ( الدولة ) .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  للرئاسة الصلاحيات في حضور أي اجتماع والمشاركة فيه .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  في حين أخطأ شخص على الرئاسة ( بالجرم المشهود ) يتم التواصل مع
                  مسؤول الشخص سواء في قطاع مدني أو عسكري ومحاسبته .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع اي رتبه كانت تتعدى او تحاسب جميع منتسبي رئاسة الوزراء .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  اذا خالف احد منتسبي رئاسة الوزراء يرفع فيه مذكره الى الرئيس او
                  النائب او المستشار .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع اي عسكري تابع لأي قطاع حكومي بعرقلة او تاخير عمل رئاسة
                  الوزراء .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  ممنوع خطف او التعرض الى رئاسة الوزراء .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  رئيس الوزراء والنائب والمستشار ممنوع ينخطفون او عرقلت طريقهم .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يحق لرئاسة الوزراء المشاركة في اي عمل عسكري او مدني .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع على العنصر الرئاسي تلقي اي امر من اي شخص الاوامر يتلقاها
                  فقط من رئيس الوزراء ومن ينوب عنة .
                </li>
                <li className="mb-4 text-[13.999999999999998pt]">
                  يمنع محاسبة او عرقلة عمل العنصر الرئاسي من اي جهة .
                </li>
              </ol>
              <div>
                <h1>[ الأولوية للحراسة كـالتالي ]</h1>
                <ol className="p-8">
                  <li className="mb-4 text-[13.999999999999998pt]">
                    رئيس الوزراء
                  </li>
                  <li className="mb-4 text-[13.999999999999998pt]">
                    نائب رئيس الوزراء
                  </li>
                  <li className="mb-4 text-[13.999999999999998pt]">
                    مستشار رئيس الوزراء
                  </li>
                </ol>
              </div>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default Prime;
